[{"a":"إِنَّا أَرْسَلْنَا نُوحًا إِلَىٰ قَوْمِهِ أَنْ أَنْذِرْ قَوْمَكَ مِنْ قَبْلِ أَنْ يَأْتِيَهُمْ عَذَابٌ أَلِيمٌ","an":"1","t":"Indeed, We sent Noah to his people, [saying], \"Warn your people before there comes to them a painful punishment.\""},{"a":"قَالَ يَا قَوْمِ إِنِّي لَكُمْ نَذِيرٌ مُبِينٌ","an":"2","t":"He said, \"O my people, indeed I am to you a clear warner,"},{"a":"أَنِ اعْبُدُوا اللَّهَ وَاتَّقُوهُ وَأَطِيعُونِ","an":"3","t":"[Saying], 'Worship Allah, fear Him and obey me."},{"a":"يَغْفِرْ لَكُمْ مِنْ ذُنُوبِكُمْ وَيُؤَخِّرْكُمْ إِلَىٰ أَجَلٍ مُسَمًّى ۚ إِنَّ أَجَلَ اللَّهِ إِذَا جَاءَ لَا يُؤَخَّرُ ۖ لَوْ كُنْتُمْ تَعْلَمُونَ","an":"4","t":"Allah will forgive you of your sins and delay you for a specified term.  Indeed, the time [set by] Allah, when it comes, will not be delayed, if you only knew.' \""},{"a":"قَالَ رَبِّ إِنِّي دَعَوْتُ قَوْمِي لَيْلًا وَنَهَارًا","an":"5","t":"He said, \"My Lord, indeed I invited my people [to truth] night and day."},{"a":"فَلَمْ يَزِدْهُمْ دُعَائِي إِلَّا فِرَارًا","an":"6","t":"But my invitation increased them not except in flight."},{"a":"وَإِنِّي كُلَّمَا دَعَوْتُهُمْ لِتَغْفِرَ لَهُمْ جَعَلُوا أَصَابِعَهُمْ فِي آذَانِهِمْ وَاسْتَغْشَوْا ثِيَابَهُمْ وَأَصَرُّوا وَاسْتَكْبَرُوا اسْتِكْبَارًا","an":"7","t":"And indeed, every time I invited them that You may forgive them, they put their fingers in their ears, covered themselves with their garments, persisted, and were arrogant with [great] arrogance."},{"a":"ثُمَّ إِنِّي دَعَوْتُهُمْ جِهَارًا","an":"8","t":"Then I invited them publicly."},{"a":"ثُمَّ إِنِّي أَعْلَنْتُ لَهُمْ وَأَسْرَرْتُ لَهُمْ إِسْرَارًا","an":"9","t":"Then I announced to them and [also] confided to them secretly"},{"a":"فَقُلْتُ اسْتَغْفِرُوا رَبَّكُمْ إِنَّهُ كَانَ غَفَّارًا","an":"10","t":"And said, 'Ask forgiveness of your Lord. Indeed, He is ever a Perpetual Forgiver."},{"a":"يُرْسِلِ السَّمَاءَ عَلَيْكُمْ مِدْرَارًا","an":"11","t":"He will send [rain from] the sky upon you in [continuing] showers"},{"a":"وَيُمْدِدْكُمْ بِأَمْوَالٍ وَبَنِينَ وَيَجْعَلْ لَكُمْ جَنَّاتٍ وَيَجْعَلْ لَكُمْ أَنْهَارًا","an":"12","t":"And give you increase in wealth and children and provide for you gardens and provide for you rivers."},{"a":"مَا لَكُمْ لَا تَرْجُونَ لِلَّهِ وَقَارًا","an":"13","t":"What is [the matter] with you that you do not attribute to Allah [due] grandeur"},{"a":"وَقَدْ خَلَقَكُمْ أَطْوَارًا","an":"14","t":"While He has created you in stages?"},{"a":"أَلَمْ تَرَوْا كَيْفَ خَلَقَ اللَّهُ سَبْعَ سَمَاوَاتٍ طِبَاقًا","an":"15","t":"Do you not consider how Allah has created seven heavens in layers"},{"a":"وَجَعَلَ الْقَمَرَ فِيهِنَّ نُورًا وَجَعَلَ الشَّمْسَ سِرَاجًا","an":"16","t":"And made the moon therein a [reflected] light and made the sun a burning lamp?"},{"a":"وَاللَّهُ أَنْبَتَكُمْ مِنَ الْأَرْضِ نَبَاتًا","an":"17","t":"And Allah has caused you to grow from the earth a [progressive] growth."},{"a":"ثُمَّ يُعِيدُكُمْ فِيهَا وَيُخْرِجُكُمْ إِخْرَاجًا","an":"18","t":"Then He will return you into it and extract you [another] extraction."},{"a":"وَاللَّهُ جَعَلَ لَكُمُ الْأَرْضَ بِسَاطًا","an":"19","t":"And Allah has made for you the earth an expanse"},{"a":"لِتَسْلُكُوا مِنْهَا سُبُلًا فِجَاجًا","an":"20","t":"That you may follow therein roads of passage.' \""},{"a":"قَالَ نُوحٌ رَبِّ إِنَّهُمْ عَصَوْنِي وَاتَّبَعُوا مَنْ لَمْ يَزِدْهُ مَالُهُ وَوَلَدُهُ إِلَّا خَسَارًا","an":"21","t":"Noah said, \"My Lord, indeed they have disobeyed me and followed him whose wealth and children will not increase him except in loss."},{"a":"وَمَكَرُوا مَكْرًا كُبَّارًا","an":"22","t":"And they conspired an immense conspiracy."},{"a":"وَقَالُوا لَا تَذَرُنَّ آلِهَتَكُمْ وَلَا تَذَرُنَّ وَدًّا وَلَا سُوَاعًا وَلَا يَغُوثَ وَيَعُوقَ وَنَسْرًا","an":"23","t":"And said, 'Never leave your gods and never leave Wadd or Suwa' or Yaghuth and Ya'uq and Nasr."},{"a":"وَقَدْ أَضَلُّوا كَثِيرًا ۖ وَلَا تَزِدِ الظَّالِمِينَ إِلَّا ضَلَالًا","an":"24","t":"And already they have misled many. And, [my Lord], do not increase the wrongdoers except in error.\""},{"a":"مِمَّا خَطِيئَاتِهِمْ أُغْرِقُوا فَأُدْخِلُوا نَارًا فَلَمْ يَجِدُوا لَهُمْ مِنْ دُونِ اللَّهِ أَنْصَارًا","an":"25","t":"Because of their sins they were drowned and put into the Fire, and they found not for themselves besides Allah [any] helpers."},{"a":"وَقَالَ نُوحٌ رَبِّ لَا تَذَرْ عَلَى الْأَرْضِ مِنَ الْكَافِرِينَ دَيَّارًا","an":"26","t":"And Noah said, \"My Lord, do not leave upon the earth from among the disbelievers an inhabitant."},{"a":"إِنَّكَ إِنْ تَذَرْهُمْ يُضِلُّوا عِبَادَكَ وَلَا يَلِدُوا إِلَّا فَاجِرًا كَفَّارًا","an":"27","t":"Indeed, if You leave them, they will mislead Your servants and not beget except [every] wicked one and [confirmed] disbeliever."},{"a":"رَبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَنْ دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَلَا تَزِدِ الظَّالِمِينَ إِلَّا تَبَارًا","an":"28","t":"My Lord, forgive me and my parents and whoever enters my house a believer and the believing men and believing women. And do not increase the wrongdoers except in destruction.\""}]