[{"a":"ق ۚ وَالْقُرْآنِ الْمَجِيدِ","an":"1","t":"Qaf.  By the honored Qur'an..."},{"a":"بَلْ عَجِبُوا أَنْ جَاءَهُمْ مُنْذِرٌ مِنْهُمْ فَقَالَ الْكَافِرُونَ هَٰذَا شَيْءٌ عَجِيبٌ","an":"2","t":"But they wonder that there has come to them a warner from among themselves, and the disbelievers say, \"This is an amazing thing."},{"a":"أَإِذَا مِتْنَا وَكُنَّا تُرَابًا ۖ ذَٰلِكَ رَجْعٌ بَعِيدٌ","an":"3","t":"When we have died and have become dust, [we will return to life]? That is a distant return.\""},{"a":"قَدْ عَلِمْنَا مَا تَنْقُصُ الْأَرْضُ مِنْهُمْ ۖ وَعِنْدَنَا كِتَابٌ حَفِيظٌ","an":"4","t":"We know what the earth diminishes of them, and with Us is a retaining record."},{"a":"بَلْ كَذَّبُوا بِالْحَقِّ لَمَّا جَاءَهُمْ فَهُمْ فِي أَمْرٍ مَرِيجٍ","an":"5","t":"But they denied the truth when it came to them, so they are in a confused condition."},{"a":"أَفَلَمْ يَنْظُرُوا إِلَى السَّمَاءِ فَوْقَهُمْ كَيْفَ بَنَيْنَاهَا وَزَيَّنَّاهَا وَمَا لَهَا مِنْ فُرُوجٍ","an":"6","t":"Have they not looked at the heaven above them -  how We structured it and adorned it and [how] it has no rifts?"},{"a":"وَالْأَرْضَ مَدَدْنَاهَا وَأَلْقَيْنَا فِيهَا رَوَاسِيَ وَأَنْبَتْنَا فِيهَا مِنْ كُلِّ زَوْجٍ بَهِيجٍ","an":"7","t":"And the earth -  We spread it out and cast therein firmly set mountains and made grow therein [something] of every beautiful kind,"},{"a":"تَبْصِرَةً وَذِكْرَىٰ لِكُلِّ عَبْدٍ مُنِيبٍ","an":"8","t":"Giving insight and a reminder for every servant who turns [to Allah ]."},{"a":"وَنَزَّلْنَا مِنَ السَّمَاءِ مَاءً مُبَارَكًا فَأَنْبَتْنَا بِهِ جَنَّاتٍ وَحَبَّ الْحَصِيدِ","an":"9","t":"And We have sent down blessed rain from the sky and made grow thereby gardens and grain from the harvest"},{"a":"وَالنَّخْلَ بَاسِقَاتٍ لَهَا طَلْعٌ نَضِيدٌ","an":"10","t":"And lofty palm trees having fruit arranged in layers -"},{"a":"رِزْقًا لِلْعِبَادِ ۖ وَأَحْيَيْنَا بِهِ بَلْدَةً مَيْتًا ۚ كَذَٰلِكَ الْخُرُوجُ","an":"11","t":"As provision for the servants, and We have given life thereby to a dead land. Thus is the resurrection."},{"a":"كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ وَأَصْحَابُ الرَّسِّ وَثَمُودُ","an":"12","t":"The people of Noah denied before them, and the companions of the well and Thamud"},{"a":"وَعَادٌ وَفِرْعَوْنُ وَإِخْوَانُ لُوطٍ","an":"13","t":"And 'Aad and Pharaoh and the brothers of Lot"},{"a":"وَأَصْحَابُ الْأَيْكَةِ وَقَوْمُ تُبَّعٍ ۚ كُلٌّ كَذَّبَ الرُّسُلَ فَحَقَّ وَعِيدِ","an":"14","t":"And the companions of the thicket and the people of Tubba'. All denied the messengers, so My threat was justly fulfilled."},{"a":"أَفَعَيِينَا بِالْخَلْقِ الْأَوَّلِ ۚ بَلْ هُمْ فِي لَبْسٍ مِنْ خَلْقٍ جَدِيدٍ","an":"15","t":"Did We fail in the first creation? But they are in confusion over a new creation."},{"a":"وَلَقَدْ خَلَقْنَا الْإِنْسَانَ وَنَعْلَمُ مَا تُوَسْوِسُ بِهِ نَفْسُهُ ۖ وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ الْوَرِيدِ","an":"16","t":"And We have already created man and know what his soul whispers to him, and We are closer to him than [his] jugular vein"},{"a":"إِذْ يَتَلَقَّى الْمُتَلَقِّيَانِ عَنِ الْيَمِينِ وَعَنِ الشِّمَالِ قَعِيدٌ","an":"17","t":"When the two receivers receive, seated on the right and on the left."},{"a":"مَا يَلْفِظُ مِنْ قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ","an":"18","t":"Man does not utter any word except that with him is an observer prepared [to record]."},{"a":"وَجَاءَتْ سَكْرَةُ الْمَوْتِ بِالْحَقِّ ۖ ذَٰلِكَ مَا كُنْتَ مِنْهُ تَحِيدُ","an":"19","t":"And the intoxication of death will bring the truth; that is what you were trying to avoid."},{"a":"وَنُفِخَ فِي الصُّورِ ۚ ذَٰلِكَ يَوْمُ الْوَعِيدِ","an":"20","t":"And the Horn will be blown. That is the Day of [carrying out] the threat."},{"a":"وَجَاءَتْ كُلُّ نَفْسٍ مَعَهَا سَائِقٌ وَشَهِيدٌ","an":"21","t":"And every soul will come, with it a driver and a witness."},{"a":"لَقَدْ كُنْتَ فِي غَفْلَةٍ مِنْ هَٰذَا فَكَشَفْنَا عَنْكَ غِطَاءَكَ فَبَصَرُكَ الْيَوْمَ حَدِيدٌ","an":"22","t":"[It will be said], \"You were certainly in unmindfulness of this, and We have removed from you your cover, so your sight, this Day, is sharp.\""},{"a":"وَقَالَ قَرِينُهُ هَٰذَا مَا لَدَيَّ عَتِيدٌ","an":"23","t":"And his companion, [the angel], will say, \"This [record] is what is with me, prepared.\""},{"a":"أَلْقِيَا فِي جَهَنَّمَ كُلَّ كَفَّارٍ عَنِيدٍ","an":"24","t":"[ Allah will say], \"Throw into Hell every obstinate disbeliever,"},{"a":"مَنَّاعٍ لِلْخَيْرِ مُعْتَدٍ مُرِيبٍ","an":"25","t":"Preventer of good, aggressor, and doubter,"},{"a":"الَّذِي جَعَلَ مَعَ اللَّهِ إِلَٰهًا آخَرَ فَأَلْقِيَاهُ فِي الْعَذَابِ الشَّدِيدِ","an":"26","t":"Who made [as equal] with Allah another deity; then throw him into the severe punishment.\""},{"a":"قَالَ قَرِينُهُ رَبَّنَا مَا أَطْغَيْتُهُ وَلَٰكِنْ كَانَ فِي ضَلَالٍ بَعِيدٍ","an":"27","t":"His [devil] companion will say, \"Our Lord, I did not make him transgress, but he [himself] was in extreme error.\""},{"a":"قَالَ لَا تَخْتَصِمُوا لَدَيَّ وَقَدْ قَدَّمْتُ إِلَيْكُمْ بِالْوَعِيدِ","an":"28","t":"[ Allah ] will say, \"Do not dispute before Me, while I had already presented to you the warning."},{"a":"مَا يُبَدَّلُ الْقَوْلُ لَدَيَّ وَمَا أَنَا بِظَلَّامٍ لِلْعَبِيدِ","an":"29","t":"The word will not be changed with Me, and never will I be unjust to the servants.\""},{"a":"يَوْمَ نَقُولُ لِجَهَنَّمَ هَلِ امْتَلَأْتِ وَتَقُولُ هَلْ مِنْ مَزِيدٍ","an":"30","t":"On the Day We will say to Hell, \"Have you been filled?\" and it will say, \"Are there some more,\""},{"a":"وَأُزْلِفَتِ الْجَنَّةُ لِلْمُتَّقِينَ غَيْرَ بَعِيدٍ","an":"31","t":"And Paradise will be brought near to the righteous, not far,"},{"a":"هَٰذَا مَا تُوعَدُونَ لِكُلِّ أَوَّابٍ حَفِيظٍ","an":"32","t":"[It will be said], \"This is what you were promised -  for every returner [to Allah ] and keeper [of His covenant]"},{"a":"مَنْ خَشِيَ الرَّحْمَٰنَ بِالْغَيْبِ وَجَاءَ بِقَلْبٍ مُنِيبٍ","an":"33","t":"Who feared the Most Merciful unseen and came with a heart returning [in repentance]."},{"a":"ادْخُلُوهَا بِسَلَامٍ ۖ ذَٰلِكَ يَوْمُ الْخُلُودِ","an":"34","t":"Enter it in peace. This is the Day of Eternity.\""},{"a":"لَهُمْ مَا يَشَاءُونَ فِيهَا وَلَدَيْنَا مَزِيدٌ","an":"35","t":"They will have whatever they wish therein, and with Us is more."},{"a":"وَكَمْ أَهْلَكْنَا قَبْلَهُمْ مِنْ قَرْنٍ هُمْ أَشَدُّ مِنْهُمْ بَطْشًا فَنَقَّبُوا فِي الْبِلَادِ هَلْ مِنْ مَحِيصٍ","an":"36","t":"And how many a generation before them did We destroy who were greater than them in [striking] power and had explored throughout the lands. Is there any place of escape?"},{"a":"إِنَّ فِي ذَٰلِكَ لَذِكْرَىٰ لِمَنْ كَانَ لَهُ قَلْبٌ أَوْ أَلْقَى السَّمْعَ وَهُوَ شَهِيدٌ","an":"37","t":"Indeed in that is a reminder for whoever has a heart or who listens while he is present [in mind]."},{"a":"وَلَقَدْ خَلَقْنَا السَّمَاوَاتِ وَالْأَرْضَ وَمَا بَيْنَهُمَا فِي سِتَّةِ أَيَّامٍ وَمَا مَسَّنَا مِنْ لُغُوبٍ","an":"38","t":"And We did certainly create the heavens and earth and what is between them in six days, and there touched Us no weariness."},{"a":"فَاصْبِرْ عَلَىٰ مَا يَقُولُونَ وَسَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ الشَّمْسِ وَقَبْلَ الْغُرُوبِ","an":"39","t":"So be patient, [O Muhammad], over what they say and exalt [ Allah ] with praise of your Lord before the rising of the sun and before its setting,"},{"a":"وَمِنَ اللَّيْلِ فَسَبِّحْهُ وَأَدْبَارَ السُّجُودِ","an":"40","t":"And [in part] of the night exalt Him and after prostration."},{"a":"وَاسْتَمِعْ يَوْمَ يُنَادِ الْمُنَادِ مِنْ مَكَانٍ قَرِيبٍ","an":"41","t":"And listen on the Day when the Caller will call out from a place that is near -"},{"a":"يَوْمَ يَسْمَعُونَ الصَّيْحَةَ بِالْحَقِّ ۚ ذَٰلِكَ يَوْمُ الْخُرُوجِ","an":"42","t":"The Day they will hear the blast [of the Horn] in truth. That is the Day of Emergence [from the graves]."},{"a":"إِنَّا نَحْنُ نُحْيِي وَنُمِيتُ وَإِلَيْنَا الْمَصِيرُ","an":"43","t":"Indeed, it is We who give life and cause death, and to Us is the destination"},{"a":"يَوْمَ تَشَقَّقُ الْأَرْضُ عَنْهُمْ سِرَاعًا ۚ ذَٰلِكَ حَشْرٌ عَلَيْنَا يَسِيرٌ","an":"44","t":"On the Day the earth breaks away from them [and they emerge] rapidly; that is a gathering easy for Us."},{"a":"نَحْنُ أَعْلَمُ بِمَا يَقُولُونَ ۖ وَمَا أَنْتَ عَلَيْهِمْ بِجَبَّارٍ ۖ فَذَكِّرْ بِالْقُرْآنِ مَنْ يَخَافُ وَعِيدِ","an":"45","t":"We are most knowing of what they say, and you are not over them a tyrant. But remind by the Qur'an whoever fears My threat."}]